tutorials/incompressible/pisoFoam/RAS/cavity/system/FOhistogram
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

histogram1
{
    // Mandatory entries
    type            histogram;
    libs            (fieldFunctionObjects);
    field           p;
    nBins           100;
    setFormat       raw;

    // Optional entries
    max             10;
    min            -10;

    // Optional (inherited) entries
    writePrecision   16;
    writeToFile      true;
    useUserTime      true;

    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   -1;
}


// ************************************************************************* //
